## ===========================================
##          DataFrame 인스턴스 생성 
## -------------------------------------------
## * Pandas에서 여러줄 데이터를 저장하는 데이터 타입
## * 구성 : 행 식별 인덱스 + 열 식별 컬럼명 + 데이터 
## * 함수 : DataFrame(datas) 
## ===========================================
## -------------------------------------------
## [1] 모듈 로딩
## -------------------------------------------
import pandas as pd 

## -------------------------------------------
## [2] DataFrame 인스턴스 생성
## 딕셔너리의 키가 컬럼
## 값은 세로/컬럼별 데이터
## -------------------------------------------
## 데이터 준비
datas = {
'A' : [10, 20], 
'B' : [33, 55],
'C' : [9, 8] 
}

## DataFrame 인스턴스 생성
df = pd.DataFrame(datas)

## -------------------------------------------
## [3] DataFrame 인스턴스 속성
## -------------------------------------------
print(f'[1] index: {df.index}\n')    # 데이터프레임 행 식별 인덱스
print(f'[2] columns: {df.columns}\n')  # 데이터프레임 컬럼 식별
print(f'[3] values: \n{df.values}\n') # 데이터프레임 저장된 데이터
print(f'[4] shape: {df.shape}\n')    # 데이터프레임 형태(행, 열) 튜플
print(f'[5] ndim: {df.ndim}차원\n') # 데이터프레임 차원 수
print(f'[6] dtypes: \n{df.dtypes}\n') # 데이터프레임 컬럼별 타입 정보

## -------------------------------------------
## [4] DataFrame 인스턴스 속성 변경
## -------------------------------------------
print("\n --- 변경 전 ---")
print(df)

print("\n --- 변경 후 ---")
df.index   = ['010', '011']
df.columns = ["가", "나", "다"]

print(df)