# 결측치 처리 - 치환

import pandas as pd
import numpy as np
import sys
sys.path.append(R'C:\Users\KDT38\Desktop\KDT_14\[2]PANDAS\utils')
import utils as u

## DF 생성
print("--------------------------------------------------------------")
df = pd.DataFrame( [ 
    [np.nan, 2, np.nan, 0],
    [3, 4, np.nan, 1],
    [np.nan, np.nan, np.nan, np.nan],
    [np.nan, 3, np.nan, 4]
    ],
    columns=list("ABCD")
)

## DF 출력
print( df )
print("--------------------------------------------------------------")

u.data_info(df)
print()


print("--------------------------------------------------------------")
# 결측치 치환: fillna()
print(df, '\n')
print(f"기본 설정값으로 결측치 치환 -> 0으로 채우기 fillna() >>>\n{df.fillna(0)}")
print("--------------------------------------------------------------")
print()


print("--------------------------------------------------------------")
# 결측치 치환: fillna()
print(df, '\n')
print(f"컬럼마다 특정 값으로 채우기 fillna() >>>\n{df.fillna( {'A':7, 'B': 0, 'c': 99, 'd' : -1})})")
print("--------------------------------------------------------------")
print()


print("--------------------------------------------------------------")
# 결측치 치환: ffill()
print(df, '\n')
print(f"이전 행 값으로 채우기 ffill() >>>\n{df.ffill()}")
print("--------------------------------------------------------------")
print()

print("--------------------------------------------------------------")
# 결측치 치환: bfill()
print(df, '\n')
print(f"다음 행 값으로 채우기 bfill() >>>\n{df.bfill()}")
print("--------------------------------------------------------------")
print()

print("--------------------------------------------------------------")
# 결측치 치환: bfill()
print(df, '\n')
print(f"다음 행 값으로 채우기 bfill(axis=0) >>>\n{df.bfill(axis=0)}")
print("--------------------------------------------------------------")
print()

print("--------------------------------------------------------------")
# 결측치 치환: bfill()
print(df, '\n')
print(f"다음 행 값으로 채우기 bfill(axis=1) >>>\n{df.bfill(axis=1)}")
print("--------------------------------------------------------------")
print()


print("--------------------------------------------------------------")
# 결측치 치환: interpolate()
print(df, '\n')
print(f"1. 보간 법으로 값 채우기 >>>\n{df.interpolate('linear')}")
print()
print(f"2. 보간 법으로 값 채우기 >>>\n{df.interpolate('linear', limit_direction = 'both')}")
print("--------------------------------------------------------------")
print()

